.. _ik_userguide:

IK Strings
============

Introduction
------------

The function :func:`clean_ee_ik() <dataprep.clean.clean_ee_ik.clean_ee_ik>` cleans a column containing Estonian Personcal ID number (IK) strings, and standardizes them in a given format. The function :func:`validate_ee_ik() <dataprep.clean.clean_ee_ik.validate_ee_ik>` validates either a single IK strings, a column of IK strings or a DataFrame of IK strings, returning `True` if the value is valid, and `False` otherwise.

IK strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "36805280109"
* `standard`: IK strings with proper whitespace in the proper places. Note that in the case of IK, the compact format is the same as the standard one.
* `birthdate`: split the date parts from the number and return the birth date, like "1875-03-16".
* `gender`: get the person's birth gender ('M' or 'F').

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_ee_ik()` and `validate_ee_ik()`.

### An example dataset containing IK strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "ik": [
            '36805280109',
            '36805280108',
            '7542011030',
            '7552A10004',  # invalid digit
            '8019010008',  # invalid date
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

            ik                                           address
0  36805280109                                     123 Pine Ave.
1  36805280108                                           main st
2   7542011030                      1234 west main heights 57033
3   7552A10004                    apt 1 789 s maple rd manhattan
4   8019010008                robie house, 789 north main street
5        hello         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7         NULL                                             hello

## 1. Default `clean_ee_ik`

By default, `clean_ee_ik` will clean ik strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_ee_ik
clean_ee_ik(df, column = "ik")

            ik                                           address     ik_clean
0  36805280109                                     123 Pine Ave.  36805280109
1  36805280108                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_ee_ik(df, column = "ik", output_format="standard")

            ik                                           address     ik_clean
0  36805280109                                     123 Pine Ave.  36805280109
1  36805280108                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `compact`

In [4]:
clean_ee_ik(df, column = "ik", output_format="compact")

            ik                                           address     ik_clean
0  36805280109                                     123 Pine Ave.  36805280109
1  36805280108                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `birthdate`

In [5]:
clean_ee_ik(df, column = "ik", output_format="birthdate")

            ik                                           address    ik_clean
0  36805280109                                     123 Pine Ave.  1968-05-28
1  36805280108                                           main st         NaN
2   7542011030                      1234 west main heights 57033         NaN
3   7552A10004                    apt 1 789 s maple rd manhattan         NaN
4   8019010008                robie house, 789 north main street         NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7         NULL                                             hello         NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned IK strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_ee_ik(df, column="ik", inplace=True)

      ik_clean                                           address
0  36805280109                                     123 Pine Ave.
1          NaN                                           main st
2          NaN                      1234 west main heights 57033
3          NaN                    apt 1 789 s maple rd manhattan
4          NaN                robie house, 789 north main street
5          NaN         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7          NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_ee_ik(df, "ik", errors="coerce")

            ik                                           address     ik_clean
0  36805280109                                     123 Pine Ave.  36805280109
1  36805280108                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `ignore`

In [8]:
clean_ee_ik(df, "ik", errors="ignore")

            ik                                           address     ik_clean
0  36805280109                                     123 Pine Ave.  36805280109
1  36805280108                                           main st  36805280108
2   7542011030                      1234 west main heights 57033   7542011030
3   7552A10004                    apt 1 789 s maple rd manhattan   7552A10004
4   8019010008                robie house, 789 north main street   8019010008
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        hello
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 4. `validate_ee_ik()`

`validate_ee_ik()` returns `True` when the input is a valid IK. Otherwise it returns `False`.

The input of `validate_ee_ik()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_ee_ik()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_ee_ik()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_ee_ik
print(validate_ee_ik('36805280109'))
print(validate_ee_ik('36805280108'))
print(validate_ee_ik('7542011030'))
print(validate_ee_ik('7552A10004'))
print(validate_ee_ik('8019010008'))
print(validate_ee_ik("hello"))
print(validate_ee_ik(np.nan))
print(validate_ee_ik("NULL"))

True
False
False
False
False
False
False
False

### Series

In [10]:
validate_ee_ik(df["ik"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: ik, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_ee_ik(df, column="ik")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: ik, dtype: bool

### Only DataFrame

In [12]:
validate_ee_ik(df)

      ik  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False